In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

# Question 1
.loc[] and .iloc[] on Sample Dataframe

In [2]:
sample_data_1 = [[1, 2, 3, 4, 5],
                [3, 4, 5, 6, 7],
                [5, 6, 7, 8, 9],
                [3, 4, 5, 6, 7],
                [5, 6, 7, 8, 9]]

In [4]:
sample_df_1 = pd.DataFrame(sample_data_1, index=['Row1','Row2','Row3','Row4','Row5'],
                          columns=["Column1","Column2","Column3","Column4","Column5"])
sample_df_1

      Column1  Column2  Column3  Column4  Column5
Row1        1        2        3        4        5
Row2        3        4        5        6        7
Row3        5        6        7        8        9
Row4        3        4        5        6        7
Row5        5        6        7        8        9

In [5]:
sample_df_1.loc[['Row1','Row4'],['Column1', 'Column5']]

      Column1  Column5
Row1        1        5
Row4        3        7

In [7]:
sample_df_1.iloc[2:5,0:3]

      Column1  Column2  Column3
Row3        5        6        7
Row4        3        4        5
Row5        5        6        7

# Question 2
 Set weekdays as an index for the data frame given below:

In [9]:
sample_data_2 = [["city", "sells", "visitors", "weekdays"],
                ["Blr" ,22, 255, "Sun"],
                ["Del" ,5 ,25, "Mon"],
                ["Hyd" ,25, 300 ,"Sat"],
                ["Pune", 30 ,455, "Sat"]]

In [19]:
sample_df_2 = pd.DataFrame(sample_data_2[1:],columns=sample_data_2[0])
sample_df_2

   city  sells  visitors weekdays
0   Blr     22       255      Sun
1   Del      5        25      Mon
2   Hyd     25       300      Sat
3  Pune     30       455      Sat

In [20]:
sample_df_2.set_index('weekdays')

          city  sells  visitors
weekdays
Sun        Blr     22       255
Mon        Del      5        25
Sat        Hyd     25       300
Sat       Pune     30       455

# Question 3
Drop an index i.e Row3 from data_frame given in question 2, and reset the index
using .reset_index() function.

In [22]:
temp_for_q3 = sample_df_2.drop(2)
temp_for_q3

   city  sells  visitors weekdays
0   Blr     22       255      Sun
1   Del      5        25      Mon
3  Pune     30       455      Sat

In [23]:
temp_for_q3.reset_index()

   index  city  sells  visitors weekdays
0      0   Blr     22       255      Sun
1      1   Del      5        25      Mon
2      3  Pune     30       455      Sat

# Question 4
df.reset_index().drop_duplicates(subset='index', keep='last').set_index('index')

In [29]:
sample_df_2

   city  sells  visitors weekdays
0   Blr     22       255      Sun
1   Del      5        25      Mon
2   Hyd     25       300      Sat
3  Pune     30       455      Sat

In [26]:
sample_df_2.reset_index().drop_duplicates(subset='index', 
                                          keep='last').set_index('index')

       city  sells  visitors weekdays
index
0       Blr     22       255      Sun
1       Del      5        25      Mon
2       Hyd     25       300      Sat
3      Pune     30       455      Sat

1. Using reset_index() function new index will be provided to the dataframe and a column index will be added to the dataframe
2. drop_duplicates() function will drop any duplicates present in the index column and if any duplicate is found it will keep the last duplicate value
3. Then that index columns is again made the index

# Question 5
Create a data frame using the given dictionary and remove the rows having
missing values(nan), not more than 2. And reset the index of the data frame.

d={'A':[1,2,np.NaN,5,8,12],
'B':[1,np.NaN,np.NaN,24,12,34],'C':[1,2,3,11,np.nan,17]}

In [30]:
sample_data_3={'A':[1,2,np.NaN,5,8,12], 
               'B':[1,np.NaN,np.NaN,24,12,34],
               'C':[1,2,3,11,np.nan,17]}

In [31]:
sample_df_3 = pd.DataFrame(sample_data_3)
sample_df_3

      A     B     C
0   1.0   1.0   1.0
1   2.0   NaN   2.0
2   NaN   NaN   3.0
3   5.0  24.0  11.0
4   8.0  12.0   NaN
5  12.0  34.0  17.0

In [44]:
# Dropping rows where there are not more than 2 NaN values 
# i.e. 1 NaN value is allowed whereas anything more must be dropped
sample_df_3.dropna(thresh=2).reset_index().drop('index',axis=1)

      A     B     C
0   1.0   1.0   1.0
1   2.0   NaN   2.0
2   5.0  24.0  11.0
3   8.0  12.0   NaN
4  12.0  34.0  17.0

# Question 6
Create a data frame using the given function and find unique values and the
number of occurrences of every value in the df.

{"col1":[1,2,3,4],'col2':[444,333,111,444,],'col3':['abc','def','ghi',"xyz"]}

In [45]:
sample_data_4 = {"col1":[1,2,3,4],
                 'col2':[444,333,111,444,],
                 'col3':['abc','def','ghi',"xyz"]}

In [46]:
sample_df_4 = pd.DataFrame(sample_data_4)
sample_df_4

   col1  col2 col3
0     1   444  abc
1     2   333  def
2     3   111  ghi
3     4   444  xyz

In [49]:
sample_df_4.nunique()

col1    4
col2    3
col3    4
dtype: int64

In [50]:
sample_df_4['col1'].unique()

array([1, 2, 3, 4], dtype=int64)

In [51]:
sample_df_4['col2'].unique()

array([444, 333, 111], dtype=int64)

In [52]:
sample_df_4['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

# Question 7
Create a data frame from the dictionary given below and perform the given
operations using .groupby() function of pandas.

{"Company": [ "CompA", "CompA", "CompB", "CompB", "CompC", "CompC"],
"Person": ["Rajesh", "Pradeep", "Amit", "Rakesh", "Suresh", "Raj"],
"Sales": [200, 120, 340, 124, 243, 350]}

Operations:
1. group data by ‘company’ label
2. apply standard deviation on grouped data by ‘company’ label
3. Sum the sales of the same companies and fetch the data, use .groupby() function

In [53]:
sample_data_5 = {"Company": [ "CompA", "CompA", "CompB", "CompB", "CompC", "CompC"], 
                 "Person": ["Rajesh", "Pradeep", "Amit", "Rakesh", "Suresh", "Raj"], 
                 "Sales": [200, 120, 340, 124, 243, 350]}

In [55]:
sample_df_5 = pd.DataFrame(sample_data_5)

In [56]:
sample_df_5

  Company   Person  Sales
0   CompA   Rajesh    200
1   CompA  Pradeep    120
2   CompB     Amit    340
3   CompB   Rakesh    124
4   CompC   Suresh    243
5   CompC      Raj    350

In [59]:
grouped_by_comapany = sample_df_5.groupby("Company")

In [61]:
grouped_by_comapany.std()

              Sales
Company
CompA     56.568542
CompB    152.735065
CompC     75.660426

In [62]:
grouped_by_comapany.sum()

         Sales
Company
CompA      320
CompB      464
CompC      593